ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_aupdm.c
/**
  ******************************************************************************
  * @file    bl606p_pdm.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_aupdm.h"
#include "pdm_reg.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  AUDIOPDM
 *  @{
 */

/** @defgroup  AUDIOPDM_Private_Macros
 *  @{
 */

/*@} end of group AUDIOPDM_Private_Macros */

/** @defgroup  AUDIOPDM_Private_Types
 *  @{
 */

/*@} end of group AUDIOPDM_Private_Types */

/** @defgroup  AUDIOPDM_Private_Variables
 *  @{
 */
static intCallback_Type *aupdmIntCbfArra[AUPDM_INT_NUM_ALL] = { NULL };

/*@} end of group AUDIOPDM_Private_Variables */

/** @defgroup  AUDIOPDM_Global_Variables
 *  @{
 */

/*@} end of group AUDIOPDM_Global_Variables */

/** @defgroup  AUDIOPDM_Private_Fun_Declaration
 *  @{
 */

/*@} end of group AUDIOPDM_Private_Fun_Declaration */

/** @defgroup  AUDIOPDM_Private_Functions
 *  @{
 */

/*@} end of group AUDIOPDM_Private_Functions */

/** @defgroup  AUDIOPDM_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  AUDIO Interrupt mask
 *
 * @param  intType: intType
 * @param  intMask: intMask
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_IntMask(Aupdm_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    switch (intType) {
        case AUPDM_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXA_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXA_INT_EN);
            }
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
            break;
        case AUPDM_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXO_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXO_INT_EN);
            }
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
            break;
        case AUPDM_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
            if (intMask) {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXU_INT_EN);
            } else {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXU_INT_EN);
            }
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
            break;

        case AUPDM_INT_NUM_ALL:
            if (intMask) {
                tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXA_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXU_INT_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_RXO_INT_EN);
                BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);

            } else {
                tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXA_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXU_INT_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXO_INT_EN);
                BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
            }
            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  read int flag
 *
 * @param  intType: intType
 *
 * @return flag status
 *
*******************************************************************************/
BL_Sts_Type Aupdm_GetIntStatus(Aupdm_INT_Type intType)
{
    uint32_t tmpVal = 0;
    BL_Sts_Type rlt = RESET;

    CHECK_PARAM(IS_AUPDM_INT_TYPE(intType));

    switch (intType) {
        case AUPDM_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, PDM_RXA_INT);
            break;
        case AUPDM_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, PDM_RXO_INT);
            break;
        case AUPDM_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            rlt = BL_IS_REG_BIT_SET(tmpVal, PDM_RXU_INT);
            break;
        default:
            break;
    }

    return rlt;
}

/****************************************************************************/ /**
 * @brief  clear audio Interrupt flag
 *
 * @param  intType: intType
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_IntClear(Aupdm_INT_Type intType)
{
    uint32_t tmpVal = 0;

