ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_aupdm.c
    CHECK_PARAM(IS_AUPDM_INT_TYPE(intType));

    switch (intType) {
        case AUPDM_INT_RX_FIFO_THR:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXA_INT);
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_STATUS, tmpVal);
            break;
        case AUPDM_INT_RX_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXO_INT);
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_STATUS, tmpVal);
            break;
        case AUPDM_INT_RX_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
            tmpVal = BL_SET_REG_BIT(PDM0_BASE, PDM_RXU_INT);
            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_STATUS, tmpVal);
            break;

        case AUPDM_INT_NUM_ALL:

            tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);

            tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXA_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXU_INT);
            tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RXO_INT);

            BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_STATUS, tmpVal);

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  AUPDM PDM interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void AUPDM_PDM_IRQHandler(void)
{
    uint8_t intIndex = 0;

    for (intIndex = 0; intIndex < AUPDM_INT_NUM_ALL; intIndex++) {
        if (Aupdm_GetIntStatus(intIndex) == SET) {
            aupdmIntCbfArra[intIndex]();
            Aupdm_IntClear(intIndex);
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AUPDM PDM Clock Initialization Function
 *
 * @param  cfg: clock configuration pra
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_Clock_Init(Aupdm_Clock_CFG_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_CLOCK_TYPE(cfg->adc_clock));
    CHECK_PARAM(IS_AUPDM_DAC_CLOCK_TYPE(cfg->dac_clock));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_AUDPDM_TOP);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_RATE, cfg->adc_clock);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ITF_INV_SEL, cfg->pdm_clk_inv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_ITF_INV_SEL, cfg->adc_clk_inv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_AUDIO_CKG_EN, 1);

    BL_WR_REG(PDM0_BASE, PDM_AUDPDM_TOP, tmpVal);

//TODO to select postion of register interrupt
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(AUPDM_IRQn, AUPDM_PDM_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  AUPDM support three channel for pdm .Meanwhile AUPDM support two DMIC Interface which
 *         supporting four pdm data source input.This function is used to select channel with pdm
 *         source.
 *
 * @param  id: pdm channel,cannot be larger than 3
 * @param  pdmSel: pdm source select
 *
 * @return Success or not
 *
*******************************************************************************/
void Aupdm_PDM_Channel_Sel(Aupdm_PDM_ID_Type id, Aupdm_PDM_Source_Type pdmSel)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_PDM_SOURCE_TYPE(pdmSel));
    CHECK_PARAM(IS_AUPDM_PDM_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_PDM_0);

    if (id == AUPDM_PDM_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_PDM_SEL, pdmSel);
    } else if (id == AUPDM_PDM_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_PDM_SEL, pdmSel);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_PDM_SEL, pdmSel);
    }
    BL_WR_REG(PDM0_BASE, PDM_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AUPDM Enable PDM
 *
 * @param  id: PDM ID
 *
 * @return Success or not
 *
*******************************************************************************/
void Aupdm_PDM_Enable(Aupdm_PDM_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_PDM_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_PDM_0);

    if (id == AUPDM_PDM_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_0_EN);
    } else if (id == AUPDM_PDM_1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_1_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_2_EN);
    }
    BL_WR_REG(PDM0_BASE, PDM_PDM_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  register interrupt callback function pointer
 *
 * @param  intType: intType
 * @param  cbFun: cbFun
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Aupdm_Int_Callback_Install(Aupdm_INT_Type intType, intCallback_Type *cbFun)
{
    CHECK_PARAM(IS_AUPDM_INT_TYPE(intType));

    aupdmIntCbfArra[intType] = cbFun;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  rx fifo flush
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_RxFifoClear(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDM_RX_FIFO_FLUSH);
    BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get Rx FIFO Count
 *
 * @param  None
 *
 * @return fifi count
 *
*******************************************************************************/
uint32_t Aupdm_GetRxFifoCount(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDM_RXA_CNT);

