ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_aupdm.c
    BL_WR_REG(PDM0_BASE, PDM_ADC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set pdm inv
 *
 * @param  id: Auido ADC ID
 * @param  swap: inv
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_ADC_PDM_Inv_Swap(Aupdm_ADC_ID_Type id, uint8_t swap)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_DAC_0);
    if (id == AUPDM_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_PDM_LVL_SWAP, swap);
    } else if (id == AUPDM_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_PDM_LVL_SWAP, swap);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_PDM_LVL_SWAP, swap);
    }
    BL_WR_REG(PDM0_BASE, PDM_DAC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set pdm value
 *
 * @param  pdm_l: pdm l
 * @param  pdm_h: pdm h
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_ADC_Set_PDM_Value(uint8_t pdm_l, uint8_t pdm_h)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_DAC_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_PDM_L, pdm_l);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_PDM_H, pdm_l);
    BL_WR_REG(PDM0_BASE, PDM_DAC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AUPDM adc Volume Config
 *
 * @param  adc_id: adc id
 * @param  volume: volume config cfg pointer
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Aupdm_ADC_Volume_Config(Aupdm_ADC_ID_Type adc_id, uint8_t volume)
{
    if (adc_id > 2) {
        return ERROR;
        /*only support 3 adc*/
    }

    if (adc_id == AUPDM_ADC_0) {
        BL_WR_REG(PDM0_BASE, PDM_ADC_S0, volume);
    } else if (adc_id == AUPDM_ADC_1) {
        BL_WR_REG(PDM0_BASE, PDM_ADC_S1, volume);
    } else {
        BL_WR_REG(PDM0_BASE, PDM_ADC_S2, volume);
    }

    return SUCCESS;
}

/*@} end of group AUPDMPDM_Public_Functions */

/*@} end of group AUPDMPDM */

/*@} end of group BL606P_Peripheral_Driver */
